content/posts/Bayesian_informal_logic_and_fallacy_by_Kevin_Korb_in_2003.md
+++
title = "Bayesian informal logic and fallacy by Kevin Korb in 2003"
author = ["Cameron Smith"]
lastmod = 2020-09-24T00:41:54-04:00
slug = "Bayesian_informal_logic_and_fallacy_by_Kevin_Korb_in_2003"
draft = false
+++

## [probabilistic inference]({{< relref "probabilistic_inference" >}}), [philosophy]({{< relref "philosophy" >}}), [logic]({{< relref "logic" >}}), [papers]({{< relref "papers" >}}) {#probabilistic-inference--probabilistic-inference-dot-md--philosophy--philosophy-dot-md--logic--logic-dot-md--papers--papers-dot-md}


## Korb, K. (2004). Bayesian Informal Logic and Fallacy. <span class="underline"><span class="underline">Informal Logic</span></span>, \_\_24\_\_(1), 41–70. <https://doi.org/10.22329/il.v24i1.2132> {#korb-k-dot--2004--dot-bayesian-informal-logic-and-fallacy-dot-24--1--41-70-dot-https-doi-dot-org-10-dot-22329-il-dot-v24i1-dot-2132}


## Abstract: Bayesian reasoning has been applied formally to statistical inference, machine learning and analysing scientific method. Here I apply it informally to more common forms of inference, namely natural language arguments. I analyse a variety of traditional fallacies, deductive, inductive and causal, and find more merit in them than is generally acknowledged. Bayesian principles provide a framework for understanding ordinary arguments which is well worth developing. {#abstract-bayesian-reasoning-has-been-applied-formally-to-statistical-inference-machine-learning-and-analysing-scientific-method-dot-here-i-apply-it-informally-to-more-common-forms-of-inference-namely-natural-language-arguments-dot-i-analyse-a-variety-of-traditional-fallacies-deductive-inductive-and-causal-and-find-more-merit-in-them-than-is-generally-acknowledged-dot-bayesian-principles-provide-a-framework-for-understanding-ordinary-arguments-which-is-well-worth-developing-dot}


## Applying bayesian inference to natural language arguments is related to a concept I have thought of in the past as folk probability being applied with significant bias in real-time in various decision-making situations. {#applying-bayesian-inference-to-natural-language-arguments-is-related-to-a-concept-i-have-thought-of-in-the-past-as-folk-probability-being-applied-with-significant-bias-in-real-time-in-various-decision-making-situations-dot}


## I would be interested to connect this with [Bayesian approaches to clinical trials and health-care evaluation by David Spiegelhalter, Keith Abrams, and Jonathan Myles in 2004]({{< relref "Bayesian_approaches_to_clinical_trials_and_health-care_evaluation_by_David_Spiegelhalter,_Keith_Abrams,_and_Jonathan_Myles_in_2004" >}}) in the context of folk probability in medicine. {#i-would-be-interested-to-connect-this-with-bayesian-approaches-to-clinical-trials-and-health-care-evaluation-by-david-spiegelhalter-keith-abrams-and-jonathan-myles-in-2004--bayesian-approaches-to-clinical-trials-and-health-care-evaluation-by-david-spiegelhalter-keith-abrams-and-jonathan-myles-in-2004-dot-md--in-the-context-of-folk-probability-in-medicine-dot}
